---
kind: property
id: P:Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldOffsetX
source: html/2e9d8537-c2f5-63f7-ed8f-3cf79187884d.htm
---
# Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "UnifiedBitmap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".